In [4]:
import os

# Delete the database file
if os.path.exists("company.db"):
    os.remove("company.db")
    print("Database 'company.db' has been deleted.")
else:
    print("Database 'company.db' does not exist.")

Database 'company.db' has been deleted.

In [5]:
import sqlite3
#Create a connection to the SQLite database
connection = sqlite3.connect("company.db")
cursor = connection.cursor()

In [7]:
# Create tables
cursor.execute('''
CREATE TABLE IF NOT EXISTS Customer (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER NOT NULL
)
''')

In [5]:
# Insert rows into Customer table
customers = [
    ("Alice", 30),
    ("Bob", 25),
    ("Charlie", 35),
    ("Diana", 28),
    ("Eve", 40)
]
cursor.executemany("INSERT INTO Customer (name, age) VALUES (?, ?)", customers)

In [6]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS Supplier (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER NOT NULL
)
''')

In [7]:
# Insert rows into Supplier table
suppliers = [
    ("Acme Corp", 50),
    ("Global Supplies", 45),
    ("Widget Co", 60),
    ("Tech Tools", 55),
    ("BuildIt Inc", 48)
]
cursor.executemany("INSERT INTO Supplier (name, age) VALUES (?, ?)", suppliers)

In [8]:

cursor.execute('''
CREATE TABLE IF NOT EXISTS Employee (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    age INTEGER NOT NULL
)
''')

In [9]:

# Insert rows into Employee table
employees = [
    ("John", 32),
    ("Emma", 29),
    ("Michael", 41),
    ("Sarah", 33),
    ("Tom", 37)
]
cursor.executemany("INSERT INTO Employee (name, age) VALUES (?, ?)", employees)

In [10]:
# Commit changes and close connection
connection.commit()
connection.close()

print("Database 'company' with tables and initial data created successfully.")

Database 'company' with tables and initial data created successfully.

In [3]:
connection.close()

In [11]:
import sqlite3

# Connect to the SQLite database
connection = sqlite3.connect("company.db")
cursor = connection.cursor()

In [12]:
# 1. Select all columns from the Customer table
cursor.execute("SELECT * FROM Customer")
print(cursor.fetchall())

[(1, 'Alice', 30), (2, 'Bob', 25), (3, 'Charlie', 35), (4, 'Diana', 28), (5, 'Eve', 40)]

In [13]:
# 2. Select specific columns from the Supplier table
cursor.execute("SELECT id, name FROM Supplier")
print(cursor.fetchall())

[(1, 'Acme Corp'), (2, 'Global Supplies'), (3, 'Widget Co'), (4, 'Tech Tools'), (5, 'BuildIt Inc')]

In [14]:

cursor.execute("SELECT * FROM Employee WHERE age BETWEEN 30 AND 40")
print(cursor.fetchall())

[(1, 'John', 32), (4, 'Sarah', 33), (5, 'Tom', 37)]

In [15]:
cursor.execute("SELECT * FROM Customer ORDER BY age ASC")
print(cursor.fetchall())

[(2, 'Bob', 25), (4, 'Diana', 28), (1, 'Alice', 30), (3, 'Charlie', 35), (5, 'Eve', 40)]

In [16]:
# 5. Select rows from Supplier table ORDER BY name DESC
cursor.execute("SELECT * FROM Supplier ORDER BY name DESC")
print(cursor.fetchall())
print("____________________________")
print(cursor.fetchone())

[(3, 'Widget Co', 60), (4, 'Tech Tools', 55), (2, 'Global Supplies', 45), (5, 'BuildIt Inc', 48), (1, 'Acme Corp', 50)]
____________________________
None

In [17]:
# 6. Select rows from Employee where name starts with 'A%'
cursor.execute("SELECT * FROM Employee WHERE name LIKE 'T%'")
print(cursor.fetchall())

[(5, 'Tom', 37)]

In [18]:
# 7. Use AND condition in Employee table
cursor.execute("SELECT * FROM Employee WHERE age > 30 AND name = 'Tom'")
print(cursor.fetchall())

[(5, 'Tom', 37)]

In [19]:
# 8. Use OR condition in Supplier table
cursor.execute("SELECT * FROM Supplier WHERE age < 50 OR name = 'Acme Corp'")
print(cursor.fetchall())

[(1, 'Acme Corp', 50), (2, 'Global Supplies', 45), (5, 'BuildIt Inc', 48)]

In [20]:
# 9. Use NOT condition in Customer table
cursor.execute("SELECT * FROM Customer WHERE NOT age = 40")
print(cursor.fetchall())

[(1, 'Alice', 30), (2, 'Bob', 25), (3, 'Charlie', 35), (4, 'Diana', 28)]

In [21]:
# 10. Limit the result to 3 rows from Supplier table
cursor.execute("SELECT * FROM Supplier LIMIT 3")
print(cursor.fetchall())

[(1, 'Acme Corp', 50), (2, 'Global Supplies', 45), (3, 'Widget Co', 60)]

In [22]:
# 11. Select all rows from Customer table and sort by name DESC
cursor.execute("SELECT * FROM Customer ORDER BY name DESC")
print(cursor.fetchall())

[(5, 'Eve', 40), (4, 'Diana', 28), (3, 'Charlie', 35), (2, 'Bob', 25), (1, 'Alice', 30)]

In [23]:
# 12. Select only name and position from Employee table
cursor.execute("SELECT name FROM Employee")
print(cursor.fetchall())

[('John',), ('Emma',), ('Michael',), ('Sarah',), ('Tom',)]

In [24]:
# 13. Select rows from Supplier table where name starts with 'G%'
cursor.execute("SELECT * FROM Supplier WHERE name LIKE 'G%'")
print(cursor.fetchall())

[(2, 'Global Supplies', 45)]

In [25]:
# 14. Select rows from Employee table where age is greater than 35 ORDER BY age ASC
cursor.execute("SELECT * FROM Employee WHERE age > 35 ORDER BY age ASC")
print(cursor.fetchall())

[(5, 'Tom', 37), (3, 'Michael', 41)]

In [26]:
# 15. Select all columns from Customer table and sort by age DESC, limit to 2 rows
cursor.execute("SELECT * FROM Customer ORDER BY age DESC LIMIT 2")
print(cursor.fetchall())

[(5, 'Eve', 40), (3, 'Charlie', 35)]

In [27]:
# Close the connection
connection.close()

In [28]:
import sqlite3

# Conn.ect to the SQLite database
connection = sqlite3.connect("company.db")
cursor = connection.cursor()

In [29]:
# Show table structure and data before changes
cursor.execute("SELECT * FROM Customer")
print("Customer Table:", cursor.fetchall())

Customer Table: [(1, 'Alice', 30), (2, 'Bob', 25), (3, 'Charlie', 35), (4, 'Diana', 28), (5, 'Eve', 40)]

In [30]:

cursor.execute('''
ALTER TABLE Customer ADD COLUMN email TEXT
''')

cursor.execute('''
UPDATE Customer SET email = 'alice@example.com' WHERE name = 'Alice'
''')

print("\nAfter Changes:")
cursor.execute("SELECT * FROM Customer")
print("Customer Table:", cursor.fetchall())

After Changes:
Customer Table: [(1, 'Alice', 30, 'alice@example.com'), (2, 'Bob', 25, None), (3, 'Charlie', 35, None), (4, 'Diana', 28, None), (5, 'Eve', 40, None)]

In [31]:
cursor.execute("SELECT * FROM Supplier")
print("Supplier Table:", cursor.fetchall())

Supplier Table: [(1, 'Acme Corp', 50), (2, 'Global Supplies', 45), (3, 'Widget Co', 60), (4, 'Tech Tools', 55), (5, 'BuildIt Inc', 48)]

In [32]:
cursor.execute('''
ALTER TABLE Supplier ADD COLUMN contact_number TEXT
''')

cursor.execute('''
UPDATE Supplier SET contact_number = '123-456-7890' WHERE name = 'Acme Corp'
''')

cursor.execute("SELECT * FROM Supplier")
print("Supplier Table:", cursor.fetchall())

Supplier Table: [(1, 'Acme Corp', 50, '123-456-7890'), (2, 'Global Supplies', 45, None), (3, 'Widget Co', 60, None), (4, 'Tech Tools', 55, None), (5, 'BuildIt Inc', 48, None)]

In [33]:
cursor.execute("SELECT * FROM Employee")
print("Employee Table:", cursor.fetchall())

Employee Table: [(1, 'John', 32), (2, 'Emma', 29), (3, 'Michael', 41), (4, 'Sarah', 33), (5, 'Tom', 37)]

In [34]:

cursor.execute('''
ALTER TABLE Employee ADD COLUMN position TEXT
''')


cursor.execute('''
UPDATE Employee SET position = 'Manager' WHERE name = 'John'
''')

cursor.execute("SELECT * FROM Employee")
print("Employee Table:", cursor.fetchall())

Employee Table: [(1, 'John', 32, 'Manager'), (2, 'Emma', 29, None), (3, 'Michael', 41, None), (4, 'Sarah', 33, None), (5, 'Tom', 37, None)]

In [35]:
connection.commit()

In [36]:

connection.close()

print("\nDatabase 'company' with modified tables and updated values.")

Database 'company' with modified tables and updated values.

In [37]:
import sqlite3

# Connect to the SQLite database
connection = sqlite3.connect("company.db")
cursor = connection.cursor()

In [38]:
# Show tables before deletion
print("Before Deletion and Drop:")
cursor.execute("SELECT * FROM Customer")

print("Customer Table:", cursor.fetchall())

Before Deletion and Drop:
Customer Table: [(1, 'Alice', 30, 'alice@example.com'), (2, 'Bob', 25, None), (3, 'Charlie', 35, None), (4, 'Diana', 28, None), (5, 'Eve', 40, None)]

In [39]:
# Delete query: Remove specific rows
cursor.execute("DELETE FROM Customer WHERE name = 'Alice'")
print("\nDeleted row where Customer name is 'Alice'.")

Deleted row where Customer name is 'Alice'.

In [40]:
cursor.execute("SELECT * FROM Customer")
print("Customer Table:", cursor.fetchall())
print("___________________________________")

Customer Table: [(2, 'Bob', 25, None), (3, 'Charlie', 35, None), (4, 'Diana', 28, None), (5, 'Eve', 40, None)]
___________________________________

In [41]:


cursor.execute("SELECT * FROM Supplier")
print("Supplier Table:", cursor.fetchall())


# Drop query: Remove a table entirely
cursor.execute("DROP TABLE IF EXISTS Supplier")
print("\nDropped Supplier table.")

Supplier Table: [(1, 'Acme Corp', 50, '123-456-7890'), (2, 'Global Supplies', 45, None), (3, 'Widget Co', 60, None), (4, 'Tech Tools', 55, None), (5, 'BuildIt Inc', 48, None)]

Dropped Supplier table.

In [42]:
# Commit changes
connection.commit()

# Show tables after deletion and drop
print("\nAfter Deletion and Drop:")
cursor.execute("SELECT * FROM Customer")


print("Customer Table:", cursor.fetchall())

try:
    cursor.execute("SELECT * FROM Supplier")
    print("Supplier Table:", cursor.fetchall())
except sqlite3.OperationalError as e:
    print("Supplier Table no longer exists.")

After Deletion and Drop:
Customer Table: [(2, 'Bob', 25, None), (3, 'Charlie', 35, None), (4, 'Diana', 28, None), (5, 'Eve', 40, None)]
Supplier Table no longer exists.

# Task

In [43]:
# Importing the SQLite3 library
import sqlite3

# Connecting to the SQLite database (or creating it if it doesn't exist)
conn = sqlite3.connect("example.db")
cursor = conn.cursor()

# Creating the customer table (if it doesn't already exist)
cursor.execute("""
CREATE TABLE IF NOT EXISTS customer (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    city TEXT,
    purchase_amount REAL
)
""")
conn.commit()

# Clear the table to avoid duplicate data
cursor.execute("DELETE FROM customer")
conn.commit()

# Inserting sample data
cursor.executemany("""
INSERT INTO customer (id, name, age, city, purchase_amount) 
VALUES (?, ?, ?, ?, ?)
""", [
    (1, "Alice", 30, "New York", 500.0),
    (2, "Bob", 25, "Los Angeles", 300.0),
    (3, "Charlie", 35, "New York", 400.0),
    (4, "David", 28, "Chicago", 250.0),
    (5, "Eve", 22, "Los Angeles", 600.0)
])


conn.commit()

In [44]:
# Question: How can I select customers who live in New York, are older than 25, 
# and have purchased more than 300, 
# ordering the results by purchase_amount in descending order?
SELECT * FROM customer WHERE 
city = 'New York' AND age > 25 AND purchase_amount > 300  order by purchase_amount desc

SyntaxError: invalid syntax (<ipython-input-44-848c62c6b6a2>, line 4)

In [48]:
# Query 2: Update
# Question: How can I update the purchase amount of the customer with ID 5 to 700?

In [49]:
# Query 3: Delete
# Question: How can I delete customers who are younger than 25?

# Task Solution

In [50]:

# Query 1: Selection with 3 conditions and ORDER BY
# Question: How can I select customers who live in New York, are older than 25, 
# and have purchased more than 300, ordering the results by purchase amount in descending order?

cursor.execute("""
SELECT * FROM customer
WHERE city = 'New York' AND age > 25 AND purchase_amount > 300
ORDER BY purchase_amount DESC
""")
results = cursor.fetchall()
for row in results:
    print(row)

(1, 'Alice', 30, 'New York', 500.0)
(3, 'Charlie', 35, 'New York', 400.0)

In [51]:
# Query 2: Update
# Question: How can I update the purchase amount of the customer with ID 5 to 700?
print("\nQuery 2: Updating a record")
cursor.execute("""
UPDATE customer
SET purchase_amount = 700
WHERE id = 5
""")
conn.commit()

# Verify update
cursor.execute("SELECT * FROM customer WHERE id = 5")
print(cursor.fetchone())

Query 2: Updating a record
(5, 'Eve', 22, 'Los Angeles', 700.0)

In [52]:

# Query 3: Delete
# Question: How can I delete customers who are younger than 25?
print("\nQuery 3: Deleting a record")
cursor.execute("""
DELETE FROM customer
WHERE age < 25
""")
conn.commit()
# Verify delete
cursor.execute("SELECT * FROM customer")
results = cursor.fetchall()
for row in results:
    print(row)

Query 3: Deleting a record
(1, 'Alice', 30, 'New York', 500.0)
(2, 'Bob', 25, 'Los Angeles', 300.0)
(3, 'Charlie', 35, 'New York', 400.0)
(4, 'David', 28, 'Chicago', 250.0)

In [53]:
# Closing the connection
conn.close()